Namespaces | Classes | Functions
ACAPI Namespace Reference
 Namespaces
namespace  | Impl
namespace  | MEP
namespace  | v1
namespace  | v2
 Classes
class  | DesignOptionCombination
A class that represents the design option combination of the view settings. More...
class  | DesignOptionCombinationViewSettings
A class that represents the design option combination settings of a view. More...
class  | DesignOptionManager
A class that contains design option related functions. More...
class  | ElementBase
A base class for all elements. More...
class  | ElementDefault
A base class for all element defaults. More...
struct  | Error
Error type for ACAPI::Result containing an error message and an error code. More...
class  | GSID
Serves as a means to query various unique identifiers of the logged-in user, facilitating stable user identification. More...
class  | ModifierBase
Base class of every Modifier classes used in ExecuteUndoableScope/ExecuteNotUndoableScope/CallDefaultModifier function. More...
class  | Object
A base class for all ACAPI objects. Purely technical. More...
class  | Result
Result is the standard return type of API functions. More...
class  | UniqueID
A unique identifier for API objects. It contains the GUID of the element and the Token of the AddOn which instantiated the element. More...
class  | View
A class that represents an Archicad navigator view. More...
 Functions
Result< GSID >  | CreateGSIDObject ()
Creates an instance of class GSID.
ACAPI::Result< void > ARCHICADAPI_EXPORT  | CallUndoableCommand (const std::function< GSErrCode()> &callback, const API_Token &token, const GS::UniString &undoString)
It executes the given callback function in an Undoable scope.
Result< View >  | FindViewByGuid (const API_Guid &guid)
Constuct a view object referring to an existing Archicad view by guid.
DesignOptionManager  | CreateDesignOptionManager ()
A function to create design option manager instance, that lets you query and manipulate design option related data.
template<typename T , typename E >
bool  | operator== (const Result< T, E > &lhs, const Result< T, E > &rhs)
template<typename T , typename E >
bool  | operator== (const Result< T, E > &lhs, types::Ok< T > ok)
template<typename E >
bool  | operator== (const Result< void, E > &lhs, types::Ok< void >)
template<typename T , typename E >
bool  | operator== (const Result< T, E > &lhs, types::Err< E > err)
Function Documentation
◆ operator==() [1/4]
 template<typename T , typename E >
 bool ACAPI::operator==  |  ( |  const Result< T, E > &  |  lhs,
|  const Result< T, E > &  |  rhs
)
◆ operator==() [2/4]
 template<typename T , typename E >
 bool ACAPI::operator==  |  ( |  const Result< T, E > &  |  lhs,
|  types::Err< E >  |  err
)
◆ operator==() [3/4]
 template<typename T , typename E >
 bool ACAPI::operator==  |  ( |  const Result< T, E > &  |  lhs,
|  types::Ok< T >  |  ok
)
◆ operator==() [4/4]
 template<typename E >
 bool ACAPI::operator==  |  ( |  const Result< void, E > &  |  lhs,
|  types::Ok< void >
)